{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 32}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "padding": "valid", "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"units": 10, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}]}